{
  "title": "Privacy Policy",
  "updated": "Last updated: 23 October 2025",
  "intro": [
    "This policy explains what happens to your personal data when you visit this website. Personal data means any information that can identify you personally.",
    "Please read the sections below for full details."
  ],
  "sections": [
    {
      "heading": "1. Privacy at a glance",
      "body": [
        "<strong>Who is responsible?</strong><br/>Data processing on this website is carried out by:<br/>Nataliia Oliinyk<br/>Email: <a href='mailto:nataliia.oliinyk.de@gmail.com'>nataliia.oliinyk.de@gmail.com</a><br/>(hereinafter “we”, “us”).",
        "<strong>How do we collect data?</strong><br/>1) You provide it (e.g., via the contact form).<br/>2) It is collected automatically when you visit the website (e.g., technical data such as browser, OS, time of access).",
        "<strong>What do we use data for?</strong><br/>To provide the website without errors and, where applicable, to analyze user behaviour.",
        "<strong>Your rights:</strong><br/>Access, rectification, deletion, restriction, objection, withdrawal of consent, and the right to lodge a complaint with a supervisory authority."
      ]
    },
    {
      "heading": "2. Hosting",
      "body": [
        "We host this website with {{hostName}}.<br/> <strong>Provider:</strong> {{hostProvider}}. <br/>Please see the provider's privacy policy: {{hostPrivacyUrl}}.",
        "<strong>Legal basis:</strong><br/> Art. 6(1)(f) GDPR (legitimate interest in reliable provision). If consent is requested, additionally Art. 6(1)(a) GDPR and § 25(1) TTDSG.",
        "<strong>Processing on behalf:</strong><br/> We have concluded a data processing agreement (DPA) with the provider."
      ]
    },
    {
      "heading": "3. General notes and mandatory information",
      "body": [
        "<strong>Controller:</strong><br/>Nataliia Oliinyk,<br/><strong>Email:</strong><br/> nataliia.oliinyk.de@gmail.com.",
        "<strong>Storage duration:</strong><br/>Unless otherwise specified, we store personal data only as long as the processing purpose applies. Statutory retention periods remain unaffected.",
        "<strong>Legal bases:</strong><br/>Consent (Art. 6(1)(a), and where applicable Art. 9(2)(a) GDPR), Contract (Art. 6(1)(b)), Legal obligation (Art. 6(1)(c)), Legitimate interests (Art. 6(1)(f)).",
        "<strong>Withdrawal:</strong><br/>You can withdraw your consent at any time with effect for the future.",
        "<strong>Right to object (Art. 21 GDPR):</strong><br/>You may object to processing based on Art. 6(1)(e) or (f) GDPR on grounds relating to your situation; for direct marketing you may object at any time.",
        "<strong>Data portability (Art. 20 GDPR):</strong><br/>You have the right to receive data concerning you in a structured, commonly used and machine-readable format.",
        "<strong>SSL/TLS:</strong><br/>This site uses TLS encryption (https://)."
      ]
    },
    {
      "heading": "4. Data collection on this website",
      "body": [
        "<strong>Cookies:</strong><br/>We use session cookies (deleted after your visit) and persistent cookies (stored until you delete them). Third-party cookies may also be set (e.g., for payments or analytics). Legal basis: Art. 6(1)(f) GDPR; where consent is obtained, Art. 6(1)(a) GDPR and § 25(1) TTDSG.",
        "<strong>Browser settings:</strong><br/>You can configure your browser to restrict or disable cookies. Disabling cookies may limit website functionality.",
        "<strong>Server log files:</strong><br/>Our provider automatically collects information (browser type/version, OS, referrer URL, hostname, time of request, IP address). These data are not merged with other data sources. Legal basis: Art. 6(1)(f) GDPR.",
        "<strong>Contact via email and contact form:</strong><br/>If you send us inquiries by email or via the contact form, we process the data you provide (e.g. first and last name, email address, subject, message, time, and technical metadata) solely for the purpose of processing your inquiry and any follow-up questions.",
        "<strong>Legal bases:</strong><br/>Art. 6(1)(b) GDPR (contract initiation or performance) if your request relates to a potential contract; Art. 6(1)(f) GDPR (legitimate interest in efficient communication) in all other cases. Separate consent is not required. The checkbox in the form serves only to acknowledge this privacy policy.",
        "<strong>Required information:</strong><br/>Fields marked as required are necessary to process your inquiry. Without them, we cannot respond to your message.",
        "<strong>Email delivery:</strong><br/>Emails generated from the contact form are sent via our own server or via the email service provider <em>[name of email/SMTP provider]</em> located in <em>[location/country]</em>. Where the provider acts as a processor on our behalf, a Data Processing Agreement (Art. 28 GDPR) is in place. If data is transferred to a third country, appropriate safeguards are ensured (in particular, the EU Standard Contractual Clauses under Art. 46 GDPR).",
        "<strong>Recipients:</strong><br/>Internal recipient: Nataliia Oliinyk (handling inquiries)<br/>External recipient (processor): <em>[name, address of email provider]</em><br/>Hosting provider: ALL-INKL.COM (see section “Hosting”).",
        "<strong>Security measures:</strong><br/>All data transmissions are TLS encrypted. Only authorized persons have access to the content. Server and mail logs are stored separately from message content and processed temporarily for security and troubleshooting purposes (Art. 6(1)(f) GDPR).",
        "<strong>Retention:</strong><br/>We retain inquiries and related communication until the request has been fully processed and for up to 12&nbsp;months thereafter, unless statutory retention obligations require longer storage or further retention is necessary to assert or defend legal claims (Art. 6(1)(f) GDPR).",
        "<strong>Spam protection:</strong><br/>To protect against misuse, we use technical measures such as rate limiting, server log checks, and a so-called “honeypot” field. No automated profiling is carried out."
      ]
    },
    {
      "heading": "5. Analytics & third-party content (optional)",
      "body": [
        "If we use analytics tools (e.g., Plausible, Matomo) or embedded content (e.g., YouTube, maps), we will inform you here and obtain consent where required.",
        "Details (tool, provider, purpose, legal basis, storage period, opt-out) will be added once such services are activated."
      ]
    },
    {
      "heading": "6. Contact",
      "body": [
        "For privacy-related inquiries, please contact:",
        "Nataliia Oliinyk, <br/>Email: nataliia.oliinyk.de@gmail.com"
      ]
    }
  ]
}
